[
"You purchased additional inventory at a cost of $325,000. You paid 40% in cash and purchased the remainder on account.",
"Wage expenses for the year, through Dec. 15th were $570,000. Pay this in full, but don’t forget about your beg. balance in wages payable. Pay your wages payable.",
"Wages earned between Dec. 15th and Dec 31st were $45,000. You won’t pay this until Jan 7th.",
"You collect $325,000 of account payments from customers.",
"You pay $285,000 cash toward your accounts payable.",
"Your company issued 1,000, 4 % bonds (face value of each bond is $1,000) at 104.5 on July 1, 2012. The bonds are due on July 1, 2016, with interest payable each January 1 and July 1. The market rate at the time of the bond issuance was 3 percent. Use the effective-interest method to calculate both the interest expense and the amortization of the bond discount when each interest payment is made.  [Adjusting Entry Required]",
"You calculate and book a $500,000 depreciation expense for the year for equipment purchased before January 1, 2012.",
"A customer pays you $400,000 for work that you will finish in January of 2013.",
"On May 1, 2012, you pay the dividends that you owe to your owners.",
"Your customers bought some of your product (you decide what your company sells). The total sale amount was $2,900,000. This cost of this product, to you, was $1,050,000. Customers paid you 60% in cash and the remainder was on account.",
"A piece of land that was originally purchased for $1,445,000 was sold for $2,045,000 cash.",
"You receive interest income based on your average cash balance. Your interest rate is 3% annually. Determine your interest income based upon the average of your ending 2010/2011 cash balances.",
"On December 31, 2012, you declare dividends of $.40 per share to be paid at a later date.",
"Purchased $23,000 of office supplies from Super Office Supplies with cash.",
"Purchased a parcel of land on March 1, 2012 for $1,000,000 by paying $400,000 in cash and signing a short-term note payable with the seller for $600,000. You must repay the $600,000 in exactly one year on March 1, 2013. You agree to pay the seller 5 percent interest (annual rate) on a quarterly basis (June 1, September 1, December 1, 2012, and March 1, 2013).  [Adjusting Entry Required]",
"Purchased new office equipment for $50,000 with cash from California Furniture on January 1, 2012. The new furniture will be depreciated over a ten-year period on a straight-line basis. The cabinet has an estimated salvage value of $0.  [Adjusting Entry Required]",
"Purchased a two-year building insurance policy on November 1st 2012 for $180,000 cash.  [Adjusting Entry Required]",
"Purchased a truck for $235,000 cash on January 1, 2012. The truck will be depreciated over an 8 year period. You decide to use the declining-balance depreciation method because it is determined that the truck will be more productive when it is newer. The truck has an estimated salvage value of $20,000.  [Adjusting Entry Required]",
"Leased additional warehouse space for two years on June 1, 2012. $60,000 cash was paid on this date which covers the full rental fee for the two years.  [Adjusting Entry Required]",
"Your top sales officer met with a new customer to discuss a potential future contract. She informs you that the customer is considering signing the $200,000 deal, which would become effective next June.",
"On January 1, 2012, a 5 year, $100,000 long-term note payable was taken from a local bank.",
"At the end of the year, $30,000 cash was paid to the local bank for the long-term note payable taken out on January 1, 2012. $25,000 of this was applied to the loan principal. The remaining amount was the accumulated interest due for 2012.",
"$47,000 cash was paid for an investment in Company X's marketable securities on November 1, 2012.",
"On December 31, 2012, the marketable (trading) securities you purchased in the preceding transaction had a fair market value of $51,000.",
"You contributed $8,000 of your own cash to the company.",
"On March 8, 2012, you received a payment of $20,000 for 500 hours of service to be performed in the future.",
"By December 31, 2012, 200 of the service hours in the preceding transaction were completed.",
"Paid cash for $30,000 worth of radio advertising on February 1st, 2012. This gives you radio advertising space for the remainder of 2012.",
"Purchased $240,000 of inventory for a new project. The purchase was made on account.",
"On December 31, 2012, the utility bill was paid for the year. The amount was $37,000 and you paid in cash.",
"A piece of equipment was sold for $550,000 cash. The equipment was originally purchased for $650,000. At the time of the sale, it had been depreciated by $75,000.",
"Received a $110,000 cash payment from a customer paying on their account.",
"Paid your supplier $16,000 cash for an inventory purchase made on account two months ago.",
"An employment contract is signed with a new regional manager. You have offered him $150,000 per year. He will not begin working for the company until March 2013.",
"A count of office supplies indicated that $7,000 of office supplies had been used by December 31, 2012.",
"Purchased and used $900 worth of fuel for the delivery truck during the month of December.",
"Purchased a Patent (Intangible Asset) for $40,000 on August 1, 2012. The patent will be amortized over a 10 year period on a straight-line basis.  [Adjusting Entry Required]",
"A customer that previously bought your product on account has filed for bankruptcy. He owed you $10,000. You expect to collect $0.",
"Since the inception of your company, you have been able to collect 85% of your ending accounts receivable balance from customers that bought your product on account. Based on this information, adjust your allowance for bad debt account. NOTE: Use your 2012 ending accounts receivable balance to make this calculation."
]
